# 1378. Replace Employee ID With The Unique Identifier
[問題](https://leetcode.com/problems/replace-employee-id-with-the-unique-identifier/description/?envType=study-plan-v2&envId=30-days-of-pandas&lang=pythondata)

## 解答の方針
mergeする。

In [1]:
import pandas as pd

In [39]:
def replace_employee_id(employees: pd.DataFrame, employees_uni: pd.DataFrame) -> pd.DataFrame:
    result = employees.merge(employees_uni, left_on="id", right_on="id", how="left")
    return result[["unique_id", "name"]]

In [40]:
employees = """
| id | name     |
| 1  | Alice    |
| 7  | Bob      |
| 11 | Meir     |
| 90 | Winston  |
| 3  | Jonathan |
"""

In [41]:
employees_uni = """
| id | unique_id |
| 3  | 1         |
| 11 | 2         |
| 90 | 3         |
"""

In [42]:
employees = employees.replace(" ", "")
with open("data.txt", "w") as f:
    f.write(employees)
emp = pd.read_csv("data.txt", sep="|")
emp.dropna(axis=1, inplace=True)

In [43]:
employees_uni = employees_uni.replace(" ", "")
with open("data.txt", "w") as f:
    f.write(employees_uni)
emp_u = pd.read_csv("data.txt", sep="|")
emp_u.dropna(axis=1, inplace=True)

In [44]:
emp

   id      name
0   1     Alice
1   7       Bob
2  11      Meir
3  90   Winston
4   3  Jonathan

In [45]:
emp_u

   id  unique_id
0   3          1
1  11          2
2  90          3

In [47]:
replace_employee_id(emp, emp_u)

   unique_id      name
0        NaN     Alice
1        NaN       Bob
2        2.0      Meir
3        3.0   Winston
4        1.0  Jonathan

## test scripts

In [46]:
result = emp.merge(emp_u, left_on="id", right_on="id", how="left")

In [38]:
result[["unique_id", "name"]]

   unique_id      name
0        NaN     Alice
1        NaN       Bob
2        2.0      Meir
3        3.0   Winston
4        1.0  Jonathan